import           Unit

square l = map (\x -> x ^ 2) l

-- Можем да го решим и с инфиксен currying на ^. Езикът ни позволява да подадем
-- инфиксна функция само с един (вместо с два) аргумента и да се приложи
-- currying като се фиксира вторият аргумент. Това се различава от обичайния
-- currying, където аргументите се фиксират първо по-предните аргументи.
square2 l = map (^ 2) l

main = do {
  assertEqual [1,4,9,16,25,36,49,64,81] (square [1..9]);
  assertEqual [1,4,9,16,25,36,49,64,81] (square2 [1..9]);
}
